<?php

return [
    'menu' => [
        'title' => 'تنظیمات ربات',
        'empty' => 'هیچ تنظیمی پیدا نشد',
    ],

    'selectors' => [
        'no_options' => 'هیچ گزینه‌ای یافت نشد',
        'prompt' => 'گزینه مورد نظر را انتخاب کنید:',
    ],

    'messages' => [
        'editing' => 'در حال ویرایش :label...',
        'updated' => ':label با موفقیت به روزرسانی شد',
        'channel_lock' => [
            'joined' => 'با تشکر از عضویت شما، می‌توانید ادامه دهید.',
            'not_joined' => 'شما هنوز در کانال عضو نشده‌اید.',
        ],
    ],

    'prompts' => [
        'enter_new_value' => 'مقدار جدید :label را وارد کنید:',
    ],

    'locale' => [
        'label' => 'زبان ربات',
    ],

    'channel_lock' => [
        'label' => 'قفل کانال',
        'status' => [
            'label' => 'وضعیت',
        ],
        'channel_id' => [
            'label' => 'شناسه کانال',
        ],
        'prompt' => '⛔️ کاربر عزیز شما در کانال عضو نشده‌اید لطفا جهت ادامه فرایند عضو شوید',
        'buttons' => [
            'join' => 'عضویت در کانال ✅',
            'confirm' => 'عضو شدم ❗️',
        ],
    ],
];

